<?php


for($j=0;$j<7;$j++){
    /*這樣這邊j這個變數就會從0開始跑到6*/ 
    /*($j=0;$j<7;$j++)這是我給for去定義j的條件
    它必須幫我成立並輸出若無法成立後則中斷*/
    for($i=0;$i<$j;$i++)
    /*因為在j的迴圈再一個for迴圈
    i從0開始跟j做   比較比j小就會顯示比j大就會中斷
    而j從0~6開始跟i從0~6開始比並且只要i成功輸出
    就會i+並且跟j+1重新比較*/
    {echo "*";}
    /*而這邊echo出來的是i有哪些成功比j大的數字迴圈
      但我把它輸出的數字定義成"*"
      若是echo$i=0,01,012,0123,01234,012345 */
    /*若是<br>在裡面會變成1個*1行  */
     echo"<br>";}
     /*若是<br>在外面就會變成先跑完一圈算是才會1行 
        所以若是外圍($j=0;$j<7;$j++)重新迴圈10次就會有10行的裡面內容*/


    

        
    /*for(起始值;條件;遞增值){執行的(過程)程式}*/

    for($j=6;$j>0;$j=$j-1){
       for($i=0;$i<$j;$i++)
        /*
        ($j=6;$j>0;$j=$j-1)->(這邊優先跑數字下去到失敗)
        從6開始扣下去跑($i=0;$i<$j;$i++)
        成功了654321而0沒有成功所以中斷
        那上層不變一樣6~1開始跑
        而($i=0;$i<$j;$i++)把條件從0變成0+1
        成功了65432
        這邊要注意就是是for前段先跑再跑後段
        跑到外圍($j=6;$j>0;$j=$j-1)遞減到0則中斷
        ($i=0;$i<$j;$i++)這個也是跑到不符合條件則中斷換+1後開始外圍重跑
        echo輸出的部分是輸出有那些數字成功
        */
        
        {echo "*";}
        
         echo"<br>";}

for($i=0;$i<4;$i++)
   {echo "&ensp;";}/*這邊只有0<1成功0   +1失敗所以中斷迴圈*/ 
   for($i=0;$i<1;$i++)
   {echo "*";}/*這邊沒有<br>所以會是出現一個空格後出現"*"*/
   echo"<br>";
   for($i=0;$i<3;$i++)
   {echo"&ensp;";}
   for($i=0;$i<3;$i++)
   {echo "*";}
   echo"<br>";
   for($i=0;$i<2;$i++)
   {echo"&ensp;";}
   for($i=0;$i<5;$i++)
   {echo "*";}
   echo"<br>";
   for($i=0;$i<1;$i++)
   {echo"&ensp;";}
   for($i=0;$i<7;$i++)
   {echo "*";}
   echo"<br>";
   for($i=0;$i<0;$i++)
   {echo"&ensp;";}
   for($i=0;$i<9;$i++)
   {echo "*";}
   echo"<br>";

   /*聖誕樹造型終止線 */

   for($i=0;$i<4;$i++)
   {echo "&ensp;";}
   for($i=0;$i<1;$i++)
   {echo "*";}
   echo"<br>";



   echo"<br>";
   echo"<br>";
   echo"<br>";
   echo"<br>";




        
/* RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR */










?>
