<?php

/*git用法
($ git init)->初始化(將沒上傳給git的資料夾上傳)
($ git status)->查看檔案狀態
($ git add . 檔案名稱)->個別準備上傳
($ git add .)->全部準備上傳
($ git commit -m"此次上傳後儲存的名稱")
($ git log)->查詢變更的時間
($ git diff 檔案編碼 檔案編碼)->兩個檔案編碼的檔案做比較
($ git checkout 檔案編碼)回溯到該編碼的檔案版本
($ git reflog)->查詢所有版本檔案編碼
($ git branch)->建立分支檔案名稱
(主線所延伸的所有分支都可以管理到 類似平行世界管理
例如我A底下有兩個B跟C分支一個測試用一個Debug用)
($ git branch 檔案名稱)則可以切換分支



回家將git載好後對資料夾做Bash後init
記得下載gitlens外掛

上課的額外補充:
密碼跟編碼差別在
密碼可還原並且有規則(因為知道規則所以可還原)
編碼不可還原且無規則(因為沒有規則所以他無法還原)


git branch=





*/
?>